In [8]:
a = [1,2,3,3]

In [9]:
a.remove(3)

In [10]:
a

[1, 2, 3]

In [4]:
a.pop(1)

2

In [5]:
a

[1]

In [17]:
class Solution:
    def singleNumber(self, nums):
        for i,ii in enumerate(nums):
            print(ii, 9999)

            if nums.count(ii) ==1:
                print(123456789)
            else:

                for il in range(nums.count(ii)):
                    #nums.pop(i)
                    print(11)

        return nums




if __name__ == '__main__':
    print(Solution().singleNumber([17,12,5,-6,12,4,17,-5,2,-3,2,4,5,16,-3,-4,15,15,-4,-5,-6]))

17 9999
11
11
12 9999
11
11
5 9999
11
11
-6 9999
11
11
12 9999
11
11
4 9999
11
11
17 9999
11
11
-5 9999
11
11
2 9999
11
11
-3 9999
11
11
2 9999
11
11
4 9999
11
11
5 9999
11
11
16 9999
123456789
-3 9999
11
11
-4 9999
11
11
15 9999
11
11
15 9999
11
11
-4 9999
11
11
-5 9999
11
11
-6 9999
11
11
[17, 12, 5, -6, 12, 4, 17, -5, 2, -3, 2, 4, 5, 16, -3, -4, 15, 15, -4, -5, -6]

In [22]:
set(a)

{1, 2, 3}

In [21]:
a = [1,1,2,2,3]

In [25]:
a.index(3)

4

In [28]:
cars = pd.DataFrame({'a':[1,2,3,4],'b':[5,6,7,8],'c':[np.nan]*4})

In [27]:
import pandas as pd
import numpy as np

In [29]:
cars

   a  b   c
0  1  5 NaN
1  2  6 NaN
2  3  7 NaN
3  4  8 NaN

In [36]:
df2

   a  b
0  B  T
1  C  F
2  D  T

In [35]:
df1

   a  b
0  A  1
1  B  2
2  C  3

In [37]:
df1 = pd.DataFrame({'a':['A','B','C'],'b':[1,2,3]})
df2 = pd.DataFrame({'a':['B','C','D'],'b':['T','F','T']})

In [38]:
pd.merge(df1,df2,how='left',on='a')

   a  b_x  b_y
0  A    1  NaN
1  B    2    T
2  C    3    F

In [40]:
a = pd.DataFrame({'a':[1,2,3,4],'b':[5,6,7,8]})
b = pd.DataFrame(np.random.randint(5,10,(4,2)),columns = ['a','b'])

In [41]:
a

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

In [42]:
b

   a  b
0  6  6
1  8  7
2  9  7
3  8  9

In [47]:
df1 = pd.DataFrame({'a':['A','B','C'],'b':[1,2,3]})
df2 = pd.DataFrame({'a':['B','C','D'],'b':[2,5,4]})

In [48]:
df1

   a  b
0  A  1
1  B  2
2  C  3

In [49]:
df2

   a  b
0  B  2
1  C  5
2  D  4

In [50]:
pd.merge(df1, df2,how='left')

   a  b
0  A  1
1  B  2
2  C  3

In [51]:
pd.merge(df1, df2,how='right')

   a  b
0  B  2
1  C  5
2  D  4

In [52]:
pd.merge(df1, df2,how='outer')

   a  b
0  A  1
1  B  2
2  C  3
3  C  5
4  D  4

In [53]:
pd.merge(df1, df2,how='inner')

   a  b
0  B  2

In [54]:
df1 = pd.DataFrame({'a':[12,121]})
df2 = pd.DataFrame({'a':['D',21],'b':['C','B']})

In [55]:
df1

     a
0   12
1  121

In [56]:
df2

    a  b
0   D  C
1  21  B

In [57]:
pd.concat([df1,df2],axis=0,sort=True)

     a    b
0   12  NaN
1  121  NaN
0    D    C
1   21    B

In [61]:
df = pd.DataFrame({"a" : [5 ,2,],"b" :[4, 5]})

In [59]:
df.columns=['aaa','bbb']

In [60]:
df

   aaa  bbb
0    5    4
1    2    5

In [62]:
df.rename(columns = {'a': 'aaa', 'b': 'bbb'})

   aaa  bbb
0    5    4
1    2    5

In [63]:
df = pd.DataFrame({'age':[15,22,31,65,12],
                  'name':['Emma','Hannah','Grace','Emily','Sophia'],
                  'Gender':['F','M','F','M','F'],
                  'Count':[62,65,78,100,50]})
names = df.groupby('name').sum()

In [64]:
names.Count.idxmax()

'Emily'

In [65]:
df

   age    name Gender  Count
0   15    Emma      F     62
1   22  Hannah      M     65
2   31   Grace      F     78
3   65   Emily      M    100
4   12  Sophia      F     50

In [72]:
df['Gender'].idxmax()

TypeError: reduction operation 'argmax' not allowed for this dtype

In [73]:
df = pd.DataFrame({'age':[15,22,31,65,12,18],                  'name':['Emma','Hannah','Grace','Emily','Sophia','Olivia'],
      'Unnamed: 0':[11349,11350,11351,11352,11353,11354],
           'Gender':['F','M','F','M','F','F']})

In [79]:
df.groupby('Gender').size()

Gender
F    4
M    2
dtype: int64

In [78]:
df['Gender'].value_counts()

F    4
M    2
Name: Gender, dtype: int64

In [80]:
raw_data = {"name": ['Bulbasaur', 'Charmander','Squirtle','Caterpie'],
            "hp": [45, 39, 44, 45],                      
            }
df = pd.DataFrame(raw_data)

In [81]:
df

         name  hp
0   Bulbasaur  45
1  Charmander  39
2    Squirtle  44
3    Caterpie  45

In [86]:
df[df.hp==df.hp.max()]

        name  hp
0  Bulbasaur  45
3   Caterpie  45

In [83]:
df[df.hp.isin(df.nlargest(1,'hp').hp)]

        name  hp
0  Bulbasaur  45
3   Caterpie  45

In [84]:
df[df.hp.isin([df.hp.sort_values(ascending = False)[0]])]

        name  hp
0  Bulbasaur  45
3   Caterpie  45

In [99]:
raw_data = {"name": ['Bulbasaur', 'Charmander','Squirtle','Caterpie'],
            "pokedex": ['yes', 'no','yes','no']                        
            }
df = pd.DataFrame(raw_data)

In [100]:
df

         name pokedex
0   Bulbasaur     yes
1  Charmander      no
2    Squirtle     yes
3    Caterpie      no

In [103]:
df.pokedex = df.pokedex.apply(lambda x:'zhao' if x == 'yes' else x)

In [104]:
df

         name pokedex
0   Bulbasaur    zhao
1  Charmander      no
2    Squirtle    zhao
3    Caterpie      no